print("--- โหมด For Loop ---")
target_laps = int(input("ตั้งเป้าหมาย วันนี้จะวิ่งกี่รอบ?: "))

# range จะเริ่มนับตั้งแต่ 1 ไปจนถึงจำนวนที่พิมพ์
for i in range(1, target_laps + 1):
    print(f"กำลังวิ่งรอบที่ {i}...")

print("เย้! วิ่งครบตามเป้าแล้ว\n")

current_lap = 1

while True: # สั่งให้ลูปทำงานไปเรื่อยๆ ก่อน
    print(f"วิ่งมาได้ {current_lap} รอบแล้ว")
    
    # เช็คเงื่อนไขทุกรอบที่วิ่งจบ
    answer = input("เหนื่อยยัง? (พิมพ์ 'y' เพื่อหยุด / กด Enter เพื่อวิ่งต่อ): ")
    
    if answer.lower() == 'y':
        print(f"โอเค พอแค่นี้ สรุปวันนี้วิ่งไป {current_lap} รอบ")
        break # คำสั่งเบรกเพื่อดีดตัวออกจากลูป
        
    current_lap += 1 # ถ้ายังไม่หยุด ก็บวกจำนวนรอบเข้าไปอีก 1